Revit 2024 API
ExportFontTableIterator Class
 An iterator to a set of font table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
Visual Basic
Public Class ExportFontTableIterator _
	Implements IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo))
Visual C++
public ref class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportFontTableIterator
See Also
ExportFontTableIterator Members
Autodesk.Revit.DB Namespace